#================================================================================
# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-

try:
    val = int(input('Введите произвольное целое число (в десятиричной системе счисления): '))
    print('Вами введено числ', val)

    print('Список цифр, используемых для записа числа:')
    if val  < 0:
        val = abs(val)

    # 1 Вариант
    x = val
    if x > 0:
        while x != 0:
            rem = x % 10
            x = x // 10
            print(rem, end=" ")
    else:
        print(x)

    # 2 Вариант
    x = val # восстановили введенное число
    #...

except:
    print('Допустим ввод только символов 0..9')
