#================================================================================
# Задание-2
# Найдите n-ое число Фибоначчи
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-

#--------------------------------------------------------------------------------
# fibonachi(n)
# Реккурсивная ф-ция вычисления числа Фибоначчи
#--------------------------------------------------------------------------------
def fibonachi(n):
    if n <= 0:
        return 0
    elif n <= 2:
        return 1
    else:
        return fibonachi(n-2) + fibonachi(n-1)

try:
    n = int(input('Введите положительное целое число (n >= 0) : '))
    fib = fibonachi(n)
    print(n, '-ое число Фибоначчи = ', fib, sep="")
except:
    print('Некорректный ввод начальных данных')

