#================================================================================
# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-

list = []

try:
    x = int(input('Введите произвольное целое число (в десятиричной системе счисления): '))

    if x  < 0:
        x = abs(x)
    if x > 0:
        while x != 0:
            list.append(x % 10)
            x = x // 10
    else:
        list.append(x)
    list.sort(reverse=True)
    print("Максимальную цифра = ", list[0])
except:
    print('Допустим ввод только символов 0..9')
