#================================================================================
# Задание-1:
# Пользователь вводит число определите, является ли данное число простым.
# Делится только на себя и на единицу
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-

try:
    n = int(input('Введите число: '))
    i = 2
    while i < n:
        if n%i == 0:
            print("Число ", n, " - не простое")
            break
        i+=1
    else:
        print("Число ", n, " - простое")
except:
    print('Допустим ввод только числового значения')
