#================================================================================
# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.
# a = input("Input a: ")
# b = input("Input b: ")
# a,b = b,a
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-


val1 = int(input('Введите значение первой переменной: '))
val2 = int(input('Введите значение второй переменной: '))

print("\nВведены следующие значения:")
print('val1', val1, sep=" = ", end="; ")
print('val2', val2, sep=" = ")

# Меняем значения переменных местами - вариант 1
tmp = val1
val1 = val2
val2 = tmp

print("\nЗначения переменных после обмена")
print('val1', val1, sep=" = ", end="; ")
print('val2', val2, sep=" = ")

# Меняем значения переменных местами - вариант 2
val1, val2 = val2, val1
print("\nЗначения переменных после обмена")
print('val1', val1, sep=" = ", end="; ")
print('val2', val2, sep=" = ")
