#================================================================================
# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
#
# Мкртычан Александр 16.12.2018
#
#================================================================================

# -*- coding: utf-8 -*-

try:
    age = int(input('Введите свой возраст: '))
    if age >= 18 and age < 200:
        print("Доступ разрешен")
    elif age < 18:
        print("Извините, пользование данным ресурсом только с 18 лет")
    else:
        print("Есть сомнения...")
except:
    print('Извините, пользование данным ресурсом разрешено только лицам, понимающим, что такое возраст')

