#================================================================================
# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-

import math

try:
    print("Нахождение корней квадратного уравнения вида a*x**2 + b*x + c = 0")

    print("\nВведение коэффициентов уравнения")
    a = int(input("Введите a: "))
    b = int(input("Введите b: "))
    c = int(input("Введите c: "))

    d = b**2 - 4 * a * c

    if d >= 0:
        d_sqrt = math.sqrt(d)
        x1 = (-b - d_sqrt) / 2 * a
        x2 = (-b + d_sqrt) / 2 * a

        # Вывод результатов ...
        print("Корни уравнения", end=": " )
        print("x1 = ", x1, end="; " )
        print("x2 = ", x2, end="\n\n" )
    else:
        print("Уравнение с заданными коэффициентами не имеет вещественных корней...")
except:
    print('Допустим ввод только числового значения')
