#================================================================================
# Задание-3
# Пользователь вводит n и m и нужно вывести на экран:
# AAABBBAAABBBAAABBB
# BBBAAABBBAAABBBAAA
# AAABBBAAABBBAAABBB
# Для этого примера n ==3, m == 3
# где n - это количество строк, m - это кол-во троек ААА в одной строке
#
# Мкртычан Александр 16.12.2018
#================================================================================

# -*- coding: utf-8 -*-

try:
    n = int(input("Введите количество строк (n): "))
    m = int(input("Введите это кол-во троек ААА (m): "))

    a = ["AAA", "BBB"]
    for i in range(n):
        for j in range(m):
            for k in range(len(a)):
                print(a[(i+k)%len(a)], end="")
        print()
except:
    print('Допустим ввод только числового значения')
